{
  "name" : "Amazon CloudWatch",
  "name_en" : null,
  "id" : "cc94cbb9-cc20-49bc-aa47-54ef25ba0b5e",
  "description" : "Amazon CloudWatch monitors your Amazon Web Services (AWS) resources and the applications you run on AWS in real time. You can use CloudWatch to collect and track metrics, which are variables you can measure for your resources and applications.\n\nThe CloudWatch home page automatically displays metrics about every AWS service you use. You can additionally create custom dashboards to display metrics about your custom applications, and display custom collections of metrics that you choose.\n\nYou can create alarms that watch metrics and send notifications or automatically make changes to the resources you are monitoring when a threshold is breached. For example, you can monitor the CPU usage and disk reads and writes of your Amazon EC2 instances and then use that data to determine whether you should launch additional instances to handle increased load. You can also use this data to stop under-used instances to save money.\n\nWith CloudWatch, you gain system-wide visibility into resource utilization, application performance, and operational health.",
  "description_en" : "aws cloudwatch",
  "coversElement" : {
    "classification" : "Technical"
  },
  "taggedWith" : [ ],
  "matchesArea" : [ {
    "skillAreaClassification" : "Technical"
  } ],
  "skillType" : {
    "skillTypeClassification" : "Knowledge_Based"
  },
  "relatesTo" : [ ],
  "isCompositeOf" : [ ],
  "isExtensionOf" : [ ],
  "additionaljsonproperties" : null,
  "skillOwner" : "61d38553-5d09-4cd3-a06a-c7173e6c1947",
  "skillOwnerUsername" : "Thor Henning Hetland",
  "editedBy" : "61d38553-5d09-4cd3-a06a-c7173e6c1947",
  "editedByUsername" : "Thor Henning Hetland",
  "networkReference" : null,
  "currentVersion" : 0,
  "createdAt" : [ 2022, 5, 23, 10, 58, 2, 863259000 ],
  "lastEdited" : [ 2022, 8, 25, 7, 5, 19, 778435000 ],
  "public" : true,
  "isExtensionOfSkill" : [ ],
  "isCompositeOfSkill" : [ ],
  "relatesToSkill" : [ ]
}