{
  "name" : "DNS",
  "name_en" : null,
  "id" : "c66d3350-65aa-4a30-b630-7a43d1894efe",
  "description" : "The Domain Name System (DNS) is a hierarchical and distributed naming system for computers, services, and other resources in the Internet or other Internet Protocol (IP) networks. It associates various information with domain names (identification strings) assigned to each of the associated entities. Most prominently, it translates readily memorized domain names to the numerical IP addresses needed for locating and identifying computer services and devices with the underlying network protocols.[1] The Domain Name System has been an essential component of the functionality of the Internet since 1985.\n\nThe Domain Name System delegates the responsibility of assigning domain names and mapping those names to Internet resources by designating authoritative name servers for each domain. Network administrators may delegate authority over subdomains of their allocated name space to other name servers. This mechanism provides distributed and fault-tolerant service and was designed to avoid a single large central database. In addition, the DNS specifies the technical functionality of the database service that is at its core. It defines the DNS protocol, a detailed specification of the data structures and data communication exchanges used in the DNS, as part of the Internet protocol suite.   Ref:  https://en.wikipedia.org/wiki/Domain_Name_System",
  "description_en" : "DNS",
  "coversElement" : {
    "classification" : "Technical"
  },
  "taggedWith" : [ ],
  "matchesArea" : [ {
    "skillAreaClassification" : "Technical"
  } ],
  "skillType" : {
    "skillTypeClassification" : "Transferable_and_Functional"
  },
  "relatesTo" : [ ],
  "isCompositeOf" : [ ],
  "isExtensionOf" : [ ],
  "additionaljsonproperties" : null,
  "skillOwner" : "61d38553-5d09-4cd3-a06a-c7173e6c1947",
  "skillOwnerUsername" : "Thor Henning Hetland",
  "editedBy" : "61d38553-5d09-4cd3-a06a-c7173e6c1947",
  "editedByUsername" : "Thor Henning Hetland",
  "networkReference" : null,
  "currentVersion" : 1,
  "createdAt" : [ 2024, 4, 30, 7, 59, 19, 833485000 ],
  "lastEdited" : [ 2024, 4, 30, 7, 59, 19, 833481000 ],
  "hide" : false,
  "public" : true,
  "relatesToSkill" : [ ],
  "isCompositeOfSkill" : [ ],
  "isExtensionOfSkill" : [ ]
}